todolist/app/Http/Controllers/HomeController.php

    public function home()
    {
      /*   $qcondition = (request('condition')); */
        $qlocation = (request('location'));
        $qcategorie = (request('categorie'));

       /*  $doCondition = false; */
        $doLocation = false;
        $doCategorie = false;

        $filter=null;


        $ad = Ad::orderBy('created_at', 'DESC');
       /*  $condition = Condition::all(); */
        $categorie = Categorie::all();
        $location = Location::all();
---
select * from `categories`
select * from `locations`