todolist/app/Http/Controllers/Auth/ProfileController.php

    public function showUserProfile($id)
    {
        $user = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '2' limit 1